wrk_rps_merged/759
Running 5m test @ http://10.97.56.205:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 504.943ms, rate sampling interval: 1740ms
  Thread calibration: mean lat.: 522.251ms, rate sampling interval: 1733ms
  Thread calibration: mean lat.: 533.012ms, rate sampling interval: 1751ms
  Thread calibration: mean lat.: 532.670ms, rate sampling interval: 1718ms
  Thread calibration: mean lat.: 539.779ms, rate sampling interval: 1728ms
  Thread calibration: mean lat.: 563.448ms, rate sampling interval: 1891ms
  Thread calibration: mean lat.: 569.277ms, rate sampling interval: 1924ms
  Thread calibration: mean lat.: 540.767ms, rate sampling interval: 1742ms
  Thread calibration: mean lat.: 552.977ms, rate sampling interval: 1752ms
  Thread calibration: mean lat.: 578.403ms, rate sampling interval: 1889ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   542.40ms  258.88ms   1.65s    68.22%
    Req/Sec     9.48      1.69    15.00     92.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  564.22ms
 75.000%  741.38ms
 90.000%  860.67ms
 99.000%    1.06s 
 99.900%    1.34s 
 99.990%    1.56s 
 99.999%    1.66s 
100.000%    1.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.558     0.000000            1         1.00
     144.383     0.100000         2902         1.11
     344.319     0.200000         5800         1.25
     442.367     0.300000         8706         1.43
     484.095     0.400000        11612         1.67
     564.223     0.500000        14516         2.00
     580.607     0.550000        15969         2.22
     642.559     0.600000        17435         2.50
     658.943     0.650000        18846         2.86
     674.815     0.700000        20316         3.33
     741.375     0.750000        21748         4.00
     747.519     0.775000        22499         4.44
     761.855     0.800000        23212         5.00
     771.071     0.825000        23934         5.71
     786.943     0.850000        24645         6.67
     843.263     0.875000        25418         8.00
     847.871     0.887500        25757         8.89
     860.671     0.900000        26107        10.00
     867.839     0.912500        26470        11.43
     873.471     0.925000        26819        13.33
     883.199     0.937500        27183        16.00
     939.519     0.943750        27363        17.78
     942.079     0.950000        27560        20.00
     945.663     0.956250        27738        22.86
     958.975     0.962500        27908        26.67
     965.119     0.968750        28092        32.00
     968.703     0.971875        28183        35.56
     971.775     0.975000        28282        40.00
     974.847     0.978125        28362        45.71
     978.431     0.981250        28449        53.33
     984.063     0.984375        28543        64.00
     987.647     0.985938        28589        71.11
    1039.871     0.987500        28632        80.00
    1059.839     0.989062        28673        91.43
    1073.151     0.990625        28720       106.67
    1140.735     0.992188        28765       128.00
    1144.831     0.992969        28788       142.22
    1154.047     0.993750        28809       160.00
    1166.335     0.994531        28834       182.86
    1178.623     0.995313        28857       213.33
    1238.015     0.996094        28877       256.00
    1241.087     0.996484        28889       284.44
    1245.183     0.996875        28903       320.00
    1252.351     0.997266        28912       365.71
    1263.615     0.997656        28924       426.67
    1272.831     0.998047        28934       512.00
    1279.999     0.998242        28940       568.89
    1284.095     0.998437        28945       640.00
    1340.415     0.998633        28953       731.43
    1341.439     0.998828        28957       853.33
    1343.487     0.999023        28962      1024.00
    1348.607     0.999121        28965      1137.78
    1361.919     0.999219        28968      1280.00
    1373.183     0.999316        28971      1462.86
    1377.279     0.999414        28974      1706.67
    1385.471     0.999512        28976      2048.00
    1442.815     0.999561        28978      2275.56
    1444.863     0.999609        28979      2560.00
    1446.911     0.999658        28981      2925.71
    1447.935     0.999707        28982      3413.33
    1465.343     0.999756        28983      4096.00
    1468.415     0.999780        28984      4551.11
    1476.607     0.999805        28985      5120.00
    1557.503     0.999829        28986      5851.43
    1557.503     0.999854        28986      6826.67
    1561.599     0.999878        28987      8192.00
    1561.599     0.999890        28987      9102.22
    1562.623     0.999902        28988     10240.00
    1562.623     0.999915        28988     11702.86
    1562.623     0.999927        28988     13653.33
    1569.791     0.999939        28989     16384.00
    1569.791     0.999945        28989     18204.44
    1569.791     0.999951        28989     20480.00
    1569.791     0.999957        28989     23405.71
    1569.791     0.999963        28989     27306.67
    1655.807     0.999969        28990     32768.00
    1655.807     1.000000        28990          inf
#[Mean    =      542.399, StdDeviation   =      258.880]
#[Max     =     1654.784, Total count    =        28990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30010 requests in 5.00m, 162.51MB read
Requests/sec:    100.01
Transfer/sec:    554.56KB