wrk_rps_merged/797
Running 5m test @ http://10.110.29.223:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 170.993ms, rate sampling interval: 717ms
  Thread calibration: mean lat.: 193.662ms, rate sampling interval: 823ms
  Thread calibration: mean lat.: 191.555ms, rate sampling interval: 721ms
  Thread calibration: mean lat.: 202.031ms, rate sampling interval: 816ms
  Thread calibration: mean lat.: 201.108ms, rate sampling interval: 725ms
  Thread calibration: mean lat.: 231.925ms, rate sampling interval: 836ms
  Thread calibration: mean lat.: 239.133ms, rate sampling interval: 846ms
  Thread calibration: mean lat.: 239.277ms, rate sampling interval: 840ms
  Thread calibration: mean lat.: 238.700ms, rate sampling interval: 842ms
  Thread calibration: mean lat.: 240.042ms, rate sampling interval: 831ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   123.85ms   97.78ms 497.92ms   65.63%
    Req/Sec     9.50      3.75    19.00     80.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  120.32ms
 75.000%  200.45ms
 90.000%  285.95ms
 99.000%  390.14ms
 99.900%  417.02ms
 99.990%  492.03ms
 99.999%  498.17ms
100.000%  498.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.464     0.000000            1         1.00
       3.293     0.100000         2899         1.11
      24.719     0.200000         5799         1.25
      45.503     0.300000         8695         1.43
      95.935     0.400000        11597         1.67
     120.319     0.500000        14503         2.00
     125.695     0.550000        15945         2.22
     132.095     0.600000        17414         2.50
     141.695     0.650000        18840         2.86
     189.951     0.700000        20300         3.33
     200.447     0.750000        21746         4.00
     205.055     0.775000        22471         4.44
     209.535     0.800000        23201         5.00
     213.759     0.825000        23926         5.71
     218.623     0.850000        24645         6.67
     227.711     0.875000        25361         8.00
     239.615     0.887500        25723         8.89
     285.951     0.900000        26093        10.00
     289.535     0.912500        26456        11.43
     292.863     0.925000        26815        13.33
     297.215     0.937500        27185        16.00
     299.519     0.943750        27351        17.78
     302.591     0.950000        27537        20.00
     305.919     0.956250        27716        22.86
     309.247     0.962500        27896        26.67
     313.343     0.968750        28077        32.00
     316.159     0.971875        28173        35.56
     318.207     0.975000        28265        40.00
     321.535     0.978125        28358        45.71
     327.679     0.981250        28440        53.33
     354.303     0.984375        28530        64.00
     385.791     0.985938        28577        71.11
     388.351     0.987500        28624        80.00
     389.375     0.989062        28666        91.43
     390.655     0.990625        28717       106.67
     391.935     0.992188        28760       128.00
     392.959     0.992969        28781       142.22
     394.239     0.993750        28803       160.00
     395.775     0.994531        28823       182.86
     397.567     0.995313        28849       213.33
     399.359     0.996094        28869       256.00
     400.383     0.996484        28883       284.44
     400.895     0.996875        28892       320.00
     402.175     0.997266        28904       365.71
     404.223     0.997656        28915       426.67
     405.503     0.998047        28925       512.00
     406.271     0.998242        28931       568.89
     407.039     0.998437        28937       640.00
     409.599     0.998633        28942       731.43
     411.903     0.998828        28948       853.33
     417.279     0.999023        28954      1024.00
     417.535     0.999121        28956      1137.78
     418.559     0.999219        28959      1280.00
     420.607     0.999316        28962      1462.86
     423.167     0.999414        28965      1706.67
     425.215     0.999512        28967      2048.00
     426.239     0.999561        28969      2275.56
     426.751     0.999609        28970      2560.00
     432.127     0.999658        28972      2925.71
     432.383     0.999707        28973      3413.33
     435.455     0.999756        28974      4096.00
     436.991     0.999780        28975      4551.11
     438.527     0.999805        28976      5120.00
     440.319     0.999829        28977      5851.43
     440.319     0.999854        28977      6826.67
     492.031     0.999878        28978      8192.00
     492.031     0.999890        28978      9102.22
     493.055     0.999902        28979     10240.00
     493.055     0.999915        28979     11702.86
     493.055     0.999927        28979     13653.33
     493.823     0.999939        28980     16384.00
     493.823     0.999945        28980     18204.44
     493.823     0.999951        28980     20480.00
     493.823     0.999957        28980     23405.71
     493.823     0.999963        28980     27306.67
     498.175     0.999969        28981     32768.00
     498.175     1.000000        28981          inf
#[Mean    =      123.849, StdDeviation   =       97.776]
#[Max     =      497.920, Total count    =        28981]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30019 requests in 5.00m, 168.57MB read
Requests/sec:    100.04
Transfer/sec:    575.27KB